{
    "session_start": "2026-02-13 13:37:58",
    "search_term": "Boulder",
    "results": {
        "categories_found": [
            "https://coupons-2save.com/greatclips/$8-99",
            "https://coupons-2save.com/greatclips/$5off",
            "https://coupons-2save.com/greatclips/$10-99",
            "https://coupons-2save.com/greatclips/$16-99",
            "https://coupons-2save.com/greatclips/$12-99",
            "https://coupons-2save.com/greatclips/$9-99",
            "https://coupons-2save.com/greatclips/$7-99",
            "https://coupons-2save.com/greatclips/$5-99",
            "https://coupons-2save.com/greatclips/$14-99",
            "https://coupons-2save.com/greatclips/$4-99",
            "https://coupons-2save.com/greatclips/$6-99",
            "https://coupons-2save.com/greatclips/$11-99",
            "https://coupons-2save.com/greatclips/$17-99",
            "https://coupons-2save.com/greatclips/$13-99"
        ],
        "offers_scanned": [
            {
                "url": "https://offers.greatclips.com/5eMfmYQ",
                "match": false,
                "raw_description": "Description\nGet a great haircut for $8.99 only at participating Dothan area Great Clips salons. To redeem the offer now, click “Redeem Now” and present this offer on your phone at the time of payment. To redeem the offer later, just enter your email and click “Save for Later”.\nTerms and Conditions\nValid only at participating Dothan area Great Clips salons. Not valid with any other offer. Limit one coupon per customer. No copies. Taxes may apply. Offer expires 02/27/2026.\n\nAll Great Clips® salons are independently owned and operated."
            },
            {
                "url": "https://offers.greatclips.com/uadPCj8",
                "match": false,
                "raw_description": "Description\nGet a great haircut for $8.99 only at participating Greenville-Spartanburg, Hendersonville, Asheville, Waynesville & greater surrounding area Great Clips salons. To redeem the offer now, click “Redeem Now” and present this offer on your phone at the time of payment. To redeem the offer later, just enter your email and click “Save for Later”.\nTerms and Conditions\nValid only at participating Greenville-Spartanburg, Hendersonville, Asheville, Waynesville & greater surrounding area Great Clips salons. Not valid with any other offer. Limit one coupon per customer. No copies. Taxes may apply. Offer expires 02/20/2026.\n\nAll Great Clips® salons are independently owned and operated."
            },
            {
                "url": "https://offers.greatclips.com/v0PQ1Gg",
                "match": false,
                "raw_description": "Description\nGet a great haircut for $8.99 at Great Clips Lakeside Plaza at 17330 W Center Rd in Omaha. To redeem the offer now, click “Redeem Now” and present this offer on your phone at the time of payment. To redeem the offer later, just enter your email and click “Save for Later”.\nTerms and Conditions\nValid at Great Clips Lakeside Plaza at 17330 W Center Rd in Omaha, NE. Not valid with any other offer. Limit one coupon per customer. No copies. Taxes may apply. Expires 04/03/2026.\n\nAll Great Clips® salons are independently owned and operated."
            },
            {
                "url": "https://offers.greatclips.com/3Oxibo2",
                "match": false,
                "raw_description": "Description\nGet a great haircut for $8.99 at Great Clips Cherrywood Plaza Shopping Center at 1468 Blackwood-Clementon Rd in Clementon. To redeem the offer now, click “Redeem Now” and present this offer on your phone at the time of payment. To redeem the offer later, just enter your email and click “Save for Later”.\nTerms and Conditions\nValid at Great Clips Cherrywood Plaza Shopping Center at 1468 Blackwood-Clementon Rd in Clementon, NJ. Not valid with any other offer. Limit one coupon per customer. No copies. Taxes may apply. Expires 03/21/2026.\n\nAll Great Clips® salons are independently owned and operated."
            },
            {
                "url": "https://offers.greatclips.com/cDkKf3t",
                "match": false,
                "raw_description": "Description\nGet a great haircut for $8.99 at Great Clips Buffaloe Bend at 7320 Buffaloe Rd in Raleigh. To redeem the offer now, click “Redeem Now” and present this offer on your phone at the time of payment. To redeem the offer later, just enter your email and click “Save for Later”.\nTerms and Conditions\nValid at Great Clips Buffaloe Bend at 7320 Buffaloe Rd in Raleigh, NC. Not valid with any other offer. Limit one coupon per customer. No copies. Taxes may apply. Expires 03/13/2026.\n\nAll Great Clips® salons are independently owned and operated."
            },
            {
                "url": "https://offers.greatclips.com/7zDVwz7",
                "match": false,
                "raw_description": "Description\nGet a great haircut for $8.99 at Great Clips Northridge Shopping Center at 6114 Falls Of Neuse Rd in Raleigh. To redeem the offer now, click “Redeem Now” and present this offer on your phone at the time of payment. To redeem the offer later, just enter your email and click “Save for Later”.\nTerms and Conditions\nValid at Great Clips Northridge Shopping Center at 6114 Falls Of Neuse Rd in Raleigh, NC. Not valid with any other offer. Limit one coupon per customer. No copies. Taxes may apply. Expires 03/13/2026.\n\nAll Great Clips® salons are independently owned and operated."
            },
            {
                "url": "https://offers.greatclips.com/sGiCX3K",
                "match": false,
                "raw_description": "Description\nGet a great haircut for $8.99 at Great Clips Fridley Market at 278 57th Ave NE in Fridley. To redeem the offer now, click “Redeem Now” and present this offer on your phone at the time of payment. To redeem the offer later, just enter your email and click “Save for Later”.\nTerms and Conditions\nValid at Great Clips Fridley Market at 278 57th Ave NE in Fridley, MN. Not valid with any other offer. Limit one coupon per customer. No copies. Taxes may apply. Expires 03/13/2026.\n\nAll Great Clips® salons are independently owned and operated."
            },
            {
                "url": "https://offers.greatclips.com/muwWYwb",
                "match": false,
                "raw_description": "Description\nGet a great haircut for $8.99 at Great Clips Precinct Line Center at 1320 Precinct Line Rd in Hurst. To redeem the offer now, click “Redeem Now” and present this offer on your phone at the time of payment. To redeem the offer later, just enter your email and click “Save for Later”.\nTerms and Conditions\nValid at Great Clips Precinct Line Center at 1320 Precinct Line Rd in Hurst, TX. Not valid with any other offer. Limit one coupon per customer. No copies. Taxes may apply. Expires 03/11/2026.\n\nAll Great Clips® salons are independently owned and operated."
            },
            {
                "url": "https://offers.greatclips.com/xXZZURv",
                "match": false,
                "raw_description": "Description\nGet a great haircut for $8.99 at Great Clips Bay Forest at 1926 El Dorado Boulevard in Houston. To redeem the offer now, click “Redeem Now” and present this offer on your phone at the time of payment. To redeem the offer later, just enter your email and click “Save for Later”.\nTerms and Conditions\nValid at Great Clips Bay Forest at 1926 El Dorado Boulevard in Houston, TX. Not valid with any other offer. Limit one coupon per customer. No copies. Taxes may apply. Expires 03/07/2026.\n\nAll Great Clips® salons are independently owned and operated."
            },
            {
                "url": "https://offers.greatclips.com/NHxDvWI",
                "match": false,
                "raw_description": "Description\nGet a great haircut for $5.00 off at Great Clips Frisco Marketplace at 7010 Preston Rd in Frisco. To redeem the offer now, click “Redeem Now” and present this offer on your phone at the time of payment. To redeem the offer later, just enter your email and click “Save for Later”.\nTerms and Conditions\nValid at Great Clips Frisco Marketplace at 7010 Preston Rd in Frisco, TX. Not valid with any other offer. Limit one coupon per customer. No copies. Taxes may apply. Expires 02/08/2026.\n\nAll Great Clips® salons are independently owned and operated."
            },
            {
                "url": "https://offers.greatclips.com/61GGnyP",
                "match": false,
                "raw_description": "Description\nGet a great haircut for $5.00 off at Great Clips Coit Main Plaza at 8949 Coit Rd in Frisco. To redeem the offer now, click “Redeem Now” and present this offer on your phone at the time of payment. To redeem the offer later, just enter your email and click “Save for Later”.\nTerms and Conditions\nValid at Great Clips Coit Main Plaza at 8949 Coit Rd in Frisco, TX. Not valid with any other offer. Limit one coupon per customer. No copies. Taxes may apply. Expires 02/07/2026.\n\nAll Great Clips® salons are independently owned and operated."
            },
            {
                "url": "https://offers.greatclips.com/mB1QVT2",
                "match": false,
                "raw_description": "Description\nGet a great haircut for $5.00 off at Great Clips Custer Star at 15962 Eldorado Pkwy in Frisco. To redeem the offer now, click “Redeem Now” and present this offer on your phone at the time of payment. To redeem the offer later, just enter your email and click “Save for Later”.\nTerms and Conditions\nValid at Great Clips Custer Star at 15962 Eldorado Pkwy in Frisco, TX. Not valid with any other offer. Limit one coupon per customer. No copies. Taxes may apply. Expires 02/07/2026.\n\nAll Great Clips® salons are independently owned and operated."
            },
            {
                "url": "https://offers.greatclips.com/irLHe9s",
                "match": false,
                "raw_description": "Description\nGet a great haircut for $5.00 off at Great Clips Clear Creek Crossing at 12925 Albemarle Rd in Charlotte. To redeem the offer now, click “Redeem Now” and present this offer on your phone at the time of payment. To redeem the offer later, just enter your email and click “Save for Later”.\nTerms and Conditions\nValid at Great Clips Clear Creek Crossing at 12925 Albemarle Rd in Charlotte, NC. Not valid with any other offer. Limit one coupon per customer. No copies. Taxes may apply. Expires 02/07/2026.\n\nAll Great Clips® salons are independently owned and operated."
            },
            {
                "url": "https://offers.greatclips.com/ENSRaLu",
                "match": false,
                "raw_description": "Description\nGet a great haircut for $5.00 off at Great Clips High Point Station at 213 Boone Station Rd in Shelbyville. To redeem the offer now, click “Redeem Now” and present this offer on your phone at the time of payment. To redeem the offer later, just enter your email and click “Save for Later”.\nTerms and Conditions\nValid at Great Clips High Point Station at 213 Boone Station Rd in Shelbyville, KY. Not valid with any other offer. Limit one coupon per customer. No copies. Taxes may apply. Expires 02/07/2026.\n\nAll Great Clips® salons are independently owned and operated."
            },
            {
                "url": "https://offers.greatclips.com/8Ti2aVG",
                "match": false,
                "raw_description": "Description\nGet a great haircut for $5.00 off at Great Clips Middletown Station at 12949 Shelbyville Rd in Louisville. To redeem the offer now, click “Redeem Now” and present this offer on your phone at the time of payment. To redeem the offer later, just enter your email and click “Save for Later”.\nTerms and Conditions\nValid at Great Clips Middletown Station at 12949 Shelbyville Rd in Louisville, KY. Not valid with any other offer. Limit one coupon per customer. No copies. Taxes may apply. Expires 02/07/2026.\n\nAll Great Clips® salons are independently owned and operated."
            },
            {
                "url": "https://offers.greatclips.com/2IzGTRB",
                "match": false,
                "raw_description": "Description\nGet a great haircut for $5.00 off at Great Clips Houston Square at 211 Russell Pkwy in Warner Robins. To redeem the offer now, click “Redeem Now” and present this offer on your phone at the time of payment. To redeem the offer later, just enter your email and click “Save for Later”.\nTerms and Conditions\nValid at Great Clips Houston Square at 211 Russell Pkwy in Warner Robins, GA. Not valid with any other offer. Limit one coupon per customer. No copies. Taxes may apply. Expires 02/07/2026.\n\nAll Great Clips® salons are independently owned and operated."
            },
            {
                "url": "https://offers.greatclips.com/qD6AGVf",
                "match": false,
                "raw_description": "Description\nGet a great haircut for $5.00 off at Great Clips La Grange Kroger Center at 2028 S Highway 53 in La Grange. To redeem the offer now, click “Redeem Now” and present this offer on your phone at the time of payment. To redeem the offer later, just enter your email and click “Save for Later”.\nTerms and Conditions\nValid at Great Clips La Grange Kroger Center at 2028 S Highway 53 in La Grange, KY. Not valid with any other offer. Limit one coupon per customer. No copies. Taxes may apply. Expires 02/07/2026.\n\nAll Great Clips® salons are independently owned and operated."
            },
            {
                "url": "https://offers.greatclips.com/PUlEQje",
                "match": false,
                "raw_description": "Description\nGet a great haircut for $5.00 off at Great Clips Baxter Center at 980 Baxter Ave in Louisville. To redeem the offer now, click “Redeem Now” and present this offer on your phone at the time of payment. To redeem the offer later, just enter your email and click “Save for Later”.\nTerms and Conditions\nValid at Great Clips Baxter Center at 980 Baxter Ave in Louisville, KY. Not valid with any other offer. Limit one coupon per customer. No copies. Taxes may apply. Expires 02/07/2026.\n\nAll Great Clips® salons are independently owned and operated."
            },
            {
                "url": "https://offers.greatclips.com/IIO89QZ",
                "match": false,
                "raw_description": "Description\nGet a great haircut for $5.00 off at Great Clips Old Capital Plaza at 413 Old Capital Plaza NW in Corydon. To redeem the offer now, click “Redeem Now” and present this offer on your phone at the time of payment. To redeem the offer later, just enter your email and click “Save for Later”.\nTerms and Conditions\nValid at Great Clips Old Capital Plaza at 413 Old Capital Plaza NW in Corydon, IN. Not valid with any other offer. Limit one coupon per customer. No copies. Taxes may apply. Expires 02/07/2026.\n\nAll Great Clips® salons are independently owned and operated."
            },
            {
                "url": "https://offers.greatclips.com/Dcezu58",
                "match": false,
                "raw_description": "Description\nGet a great haircut for $10.99 only at participating Sioux City-Norfolk area Great Clips salons. To redeem the offer now, click “Redeem Now” and present this offer on your phone at the time of payment. To redeem the offer later, just enter your email and click “Save for Later”.\nTerms and Conditions\nValid only at participating Sioux City-Norfolk area Great Clips salons. Not valid with any other offer. Limit one coupon per customer. No copies. Taxes may apply. Offer expires 02/20/2026.\n\nAll Great Clips® salons are independently owned and operated."
            },
            {
                "url": "https://offers.greatclips.com/dkIygSf",
                "match": false,
                "raw_description": "Description\nGet a great haircut for $10.99 at Great Clips Springtown Shopping Center at 1180 Thorpe Ln in San Marcos. To redeem the offer now, click “Redeem Now” and present this offer on your phone at the time of payment. To redeem the offer later, just enter your email and click “Save for Later”.\nTerms and Conditions\nValid at Great Clips Springtown Shopping Center at 1180 Thorpe Ln in San Marcos, TX. Not valid with any other offer. Limit one coupon per customer. No copies. Taxes may apply. Expires 04/07/2026.\n\nAll Great Clips® salons are independently owned and operated."
            },
            {
                "url": "https://offers.greatclips.com/WwsRrEB",
                "match": false,
                "raw_description": "Description\nGet a great haircut for $10.99 at Great Clips Woodway Plaza at 824 Hewitt Dr in Waco. To redeem the offer now, click “Redeem Now” and present this offer on your phone at the time of payment. To redeem the offer later, just enter your email and click “Save for Later”.\nTerms and Conditions\nValid at Great Clips Woodway Plaza at 824 Hewitt Dr in Waco, TX. Not valid with any other offer. Limit one coupon per customer. No copies. Taxes may apply. Expires 04/07/2026.\n\nAll Great Clips® salons are independently owned and operated."
            },
            {
                "url": "https://offers.greatclips.com/R12OToz",
                "match": false,
                "raw_description": "Description\nGet a great haircut for $10.99 at Great Clips Valley Mills HEB at 1821 S Valley Mills Dr in Waco. To redeem the offer now, click “Redeem Now” and present this offer on your phone at the time of payment. To redeem the offer later, just enter your email and click “Save for Later”.\nTerms and Conditions\nValid at Great Clips Valley Mills HEB at 1821 S Valley Mills Dr in Waco, TX. Not valid with any other offer. Limit one coupon per customer. No copies. Taxes may apply. Expires 04/07/2026.\n\nAll Great Clips® salons are independently owned and operated."
            },
            {
                "url": "https://offers.greatclips.com/4n896Ai",
                "match": false,
                "raw_description": "Description\nGet a great haircut for $10.99 at Great Clips Brazos Marketplace at 631 N Harvey Mitchell Pkwy in Bryan. To redeem the offer now, click “Redeem Now” and present this offer on your phone at the time of payment. To redeem the offer later, just enter your email and click “Save for Later”.\nTerms and Conditions\nValid at Great Clips Brazos Marketplace at 631 N Harvey Mitchell Pkwy in Bryan, TX. Not valid with any other offer. Limit one coupon per customer. No copies. Taxes may apply. Expires 04/07/2026.\n\nAll Great Clips® salons are independently owned and operated."
            },
            {
                "url": "https://offers.greatclips.com/tjVfvhA",
                "match": false,
                "raw_description": "Description\nGet a great haircut for $10.99 at Great Clips Colony Park at 2305 Boonville Rd in Bryan. To redeem the offer now, click “Redeem Now” and present this offer on your phone at the time of payment. To redeem the offer later, just enter your email and click “Save for Later”.\nTerms and Conditions\nValid at Great Clips Colony Park at 2305 Boonville Rd in Bryan, TX. Not valid with any other offer. Limit one coupon per customer. No copies. Taxes may apply. Expires 04/07/2026.\n\nAll Great Clips® salons are independently owned and operated."
            },
            {
                "url": "https://offers.greatclips.com/aCAtuVU",
                "match": false,
                "raw_description": "Description\nGet a great haircut for $10.99 at Great Clips Springtown Shopping Center at 1180 Thorpe Ln in San Marcos. To redeem the offer now, click “Redeem Now” and present this offer on your phone at the time of payment. To redeem the offer later, just enter your email and click “Save for Later”.\nTerms and Conditions\nValid at Great Clips Springtown Shopping Center at 1180 Thorpe Ln in San Marcos, TX. Not valid with any other offer. Limit one coupon per customer. No copies. Taxes may apply. Expires 04/07/2026.\n\nAll Great Clips® salons are independently owned and operated."
            },
            {
                "url": "https://offers.greatclips.com/4ECj50d",
                "match": false,
                "raw_description": "Description\nGet a great haircut for $10.99 at Great Clips Lakewood Center at 1230 N Valley Mills Dr in Waco. To redeem the offer now, click “Redeem Now” and present this offer on your phone at the time of payment. To redeem the offer later, just enter your email and click “Save for Later”.\nTerms and Conditions\nValid at Great Clips Lakewood Center at 1230 N Valley Mills Dr in Waco, TX. Not valid with any other offer. Limit one coupon per customer. No copies. Taxes may apply. Expires 04/07/2026.\n\nAll Great Clips® salons are independently owned and operated."
            },
            {
                "url": "https://offers.greatclips.com/gGmwxRu",
                "match": false,
                "raw_description": "Description\nGet a great haircut for $10.99 at Great Clips Hewitt Walmart at 231 E Enterprise in Hewitt. To redeem the offer now, click “Redeem Now” and present this offer on your phone at the time of payment. To redeem the offer later, just enter your email and click “Save for Later”.\nTerms and Conditions\nValid at Great Clips Hewitt Walmart at 231 E Enterprise in Hewitt, TX. Not valid with any other offer. Limit one coupon per customer. No copies. Taxes may apply. Expires 04/07/2026.\n\nAll Great Clips® salons are independently owned and operated."
            },
            {
                "url": "https://offers.greatclips.com/gS1yuyY",
                "match": false,
                "raw_description": "Description\nGet a great haircut for $10.99 at Great Clips The Crossing Shopping Center at 901 N Interstate Hwy 35 in Bellmead. To redeem the offer now, click “Redeem Now” and present this offer on your phone at the time of payment. To redeem the offer later, just enter your email and click “Save for Later”.\nTerms and Conditions\nValid at Great Clips The Crossing Shopping Center at 901 N Interstate Hwy 35 in Bellmead, TX. Not valid with any other offer. Limit one coupon per customer. No copies. Taxes may apply. Expires 04/07/2026.\n\nAll Great Clips® salons are independently owned and operated."
            },
            {
                "url": "https://offers.greatclips.com/BOwGSM3",
                "match": false,
                "raw_description": "Description\nGet a great haircut for $16.99 at Great Clips Ygnacio Plaza at 1833 Ygnacio Valley Rd in Walnut Creek. To redeem the offer now, click “Redeem Now” and present this offer on your phone at the time of payment. To redeem the offer later, just enter your email and click “Save for Later”.\nTerms and Conditions\nValid at Great Clips Ygnacio Plaza at 1833 Ygnacio Valley Rd in Walnut Creek, CA. Not valid with any other offer. Limit one coupon per customer. No copies. Taxes may apply. Expires 03/01/2026.\n\nAll Great Clips® salons are independently owned and operated."
            },
            {
                "url": "https://offers.greatclips.com/ufPorn9",
                "match": false,
                "raw_description": "Description\nGet a great haircut for $16.99 at Great Clips Riverchase Plaza at 11208 Tamiami Trl N in Naples. To redeem the offer now, click “Redeem Now” and present this offer on your phone at the time of payment. To redeem the offer later, just enter your email and click “Save for Later”.\nTerms and Conditions\nValid at Great Clips Riverchase Plaza at 11208 Tamiami Trl N in Naples, FL. Not valid with any other offer. Limit one coupon per customer. No copies. Taxes may apply. Expires 02/28/2026.\n\nAll Great Clips® salons are independently owned and operated."
            },
            {
                "url": "https://offers.greatclips.com/zZR80bO",
                "match": false,
                "raw_description": "Description\nGet a great haircut for $16.99 at Great Clips El Cerrito Plaza at 4030 El Cerrito Plaza in El Cerrito. To redeem the offer now, click “Redeem Now” and present this offer on your phone at the time of payment. To redeem the offer later, just enter your email and click “Save for Later”.\nTerms and Conditions\nValid at Great Clips El Cerrito Plaza at 4030 El Cerrito Plaza in El Cerrito, CA. Not valid with any other offer. Limit one coupon per customer. No copies. Taxes may apply. Expires 02/22/2026.\n\nAll Great Clips® salons are independently owned and operated."
            },
            {
                "url": "https://offers.greatclips.com/Luz2UyB",
                "match": false,
                "raw_description": "Description\nGet a great haircut for $12.99 only at participating Fresno San Joaquin Valley area Great Clips salons. To redeem the offer now, click “Redeem Now” and present this offer on your phone at the time of payment. To redeem the offer later, just enter your email and click “Save for Later”.\nTerms and Conditions\nValid only at participating Fresno San Joaquin Valley area Great Clips salons . Not valid with any other offer. Limit one coupon per customer. No copies. Taxes may apply. Offer expires 02/20/2026.\n\nAll Great Clips® salons are independently owned and operated."
            },
            {
                "url": "https://offers.greatclips.com/m5YDjeL",
                "match": false,
                "raw_description": "Description\nGet a great haircut for $12.99 at Great Clips The Crosslands at 690 Centerview Blvd in Kissimmee. To redeem the offer now, click “Redeem Now” and present this offer on your phone at the time of payment. To redeem the offer later, just enter your email and click “Save for Later”.\nTerms and Conditions\nValid at Great Clips The Crosslands at 690 Centerview Blvd in Kissimmee, FL. Not valid with any other offer. Limit one coupon per customer. No copies. Taxes may apply. Expires 03/08/2026.\n\nAll Great Clips® salons are independently owned and operated."
            },
            {
                "url": "https://offers.greatclips.com/nuZzaz0",
                "match": false,
                "raw_description": "Description\nGet a great haircut for $12.99 at Great Clips Shoppes of Eagle Ridge at 7965 State Rd 50 in Groveland. To redeem the offer now, click “Redeem Now” and present this offer on your phone at the time of payment. To redeem the offer later, just enter your email and click “Save for Later”.\nTerms and Conditions\nValid at Great Clips Shoppes of Eagle Ridge at 7965 State Rd 50 in Groveland, FL. Not valid with any other offer. Limit one coupon per customer. No copies. Taxes may apply. Expires 03/08/2026.\n\nAll Great Clips® salons are independently owned and operated."
            },
            {
                "url": "https://offers.greatclips.com/FhIDrNy",
                "match": false,
                "raw_description": "Description\nGet a great haircut for $12.99 at Great Clips Plaza at Metro at 2615 S Hiawassee Rd in Orlando. To redeem the offer now, click “Redeem Now” and present this offer on your phone at the time of payment. To redeem the offer later, just enter your email and click “Save for Later”.\nTerms and Conditions\nValid at Great Clips Plaza at Metro at 2615 S Hiawassee Rd in Orlando, FL. Not valid with any other offer. Limit one coupon per customer. No copies. Taxes may apply. Expires 03/08/2026.\n\nAll Great Clips® salons are independently owned and operated."
            },
            {
                "url": "https://offers.greatclips.com/vXGIjME",
                "match": false,
                "raw_description": "Description\nGet a great haircut for $12.99 at Great Clips Oakridge Plaza at 9590 SW Highway 200 in Ocala. To redeem the offer now, click “Redeem Now” and present this offer on your phone at the time of payment. To redeem the offer later, just enter your email and click “Save for Later”.\nTerms and Conditions\nValid at Great Clips Oakridge Plaza at 9590 SW Highway 200 in Ocala, FL. Not valid with any other offer. Limit one coupon per customer. No copies. Taxes may apply. Expires 03/08/2026.\n\nAll Great Clips® salons are independently owned and operated."
            },
            {
                "url": "https://offers.greatclips.com/rIXnU4f",
                "match": false,
                "raw_description": "Description\nGet a great haircut for $12.99 at Great Clips Celebration Pointe at 1709 Future Way in Celebration. To redeem the offer now, click “Redeem Now” and present this offer on your phone at the time of payment. To redeem the offer later, just enter your email and click “Save for Later”.\nTerms and Conditions\nValid at Great Clips Celebration Pointe at 1709 Future Way in Celebration, FL. Not valid with any other offer. Limit one coupon per customer. No copies. Taxes may apply. Expires 03/08/2026.\n\nAll Great Clips® salons are independently owned and operated."
            },
            {
                "url": "https://offers.greatclips.com/lOYd354",
                "match": false,
                "raw_description": "Description\nGet a great haircut for $12.99 at Great Clips Springfield Plaza at 3844 West Sunshine Street in Springfield. To redeem the offer now, click “Redeem Now” and present this offer on your phone at the time of payment. To redeem the offer later, just enter your email and click “Save for Later”.\nTerms and Conditions\nValid at Great Clips Springfield Plaza at 3844 West Sunshine Street in Springfield, MO. Not valid with any other offer. Limit one coupon per customer. No copies. Taxes may apply. Expires 03/06/2026.\n\nAll Great Clips® salons are independently owned and operated."
            },
            {
                "url": "https://offers.greatclips.com/h3o8YFP",
                "match": false,
                "raw_description": "Description\nGet a great haircut for $12.99 at Great Clips Commerce Marketplace at 1729 Haggerty Hwy in Commerce Township. To redeem the offer now, click “Redeem Now” and present this offer on your phone at the time of payment. To redeem the offer later, just enter your email and click “Save for Later”.\nTerms and Conditions\nValid at Great Clips Commerce Marketplace at 1729 Haggerty Hwy in Commerce Township, MI. Not valid with any other offer. Limit one coupon per customer. No copies. Taxes may apply. Expires 03/06/2026.\n\nAll Great Clips® salons are independently owned and operated."
            },
            {
                "url": "https://offers.greatclips.com/Q26b7hx",
                "match": false,
                "raw_description": "Description\nGet a great haircut for $12.99 at Great Clips Cherry Hill and Lilley Rd at 660 S LILLEY RD in Canton. To redeem the offer now, click “Redeem Now” and present this offer on your phone at the time of payment. To redeem the offer later, just enter your email and click “Save for Later”.\nTerms and Conditions\nValid at Great Clips Cherry Hill and Lilley Rd at 660 S LILLEY RD in Canton, MI. Not valid with any other offer. Limit one coupon per customer. No copies. Taxes may apply. Expires 03/06/2026.\n\nAll Great Clips® salons are independently owned and operated."
            },
            {
                "url": "https://offers.greatclips.com/Nmp0PeU",
                "match": false,
                "raw_description": "Description\nGet a great haircut for $12.99 at Great Clips Canton Meijer at 45001 Ford Rd in Canton. To redeem the offer now, click “Redeem Now” and present this offer on your phone at the time of payment. To redeem the offer later, just enter your email and click “Save for Later”.\nTerms and Conditions\nValid at Great Clips Canton Meijer at 45001 Ford Rd in Canton, MI. Not valid with any other offer. Limit one coupon per customer. No copies. Taxes may apply. Expires 03/06/2026.\n\nAll Great Clips® salons are independently owned and operated."
            },
            {
                "url": "https://offers.greatclips.com/aWkLplt",
                "match": false,
                "raw_description": "Description\nGet a great haircut for $9.99 only at participating Panama City area Great Clips salons. To redeem the offer now, click “Redeem Now” and present this offer on your phone at the time of payment. To redeem the offer later, just enter your email and click “Save for Later”.\nTerms and Conditions\nValid only at participating Panama City area Great Clips salons . Not valid with any other offer. Limit one coupon per customer. No copies. Taxes may apply. Offer expires 02/27/2026.\n\nAll Great Clips® salons are independently owned and operated."
            },
            {
                "url": "https://offers.greatclips.com/dAGM47h",
                "match": false,
                "raw_description": "Description\nGet a great haircut for $9.99 only at participating Mankato area Great Clips salons. To redeem the offer now, click “Redeem Now” and present this offer on your phone at the time of payment. To redeem the offer later, just enter your email and click “Save for Later”.\nTerms and Conditions\nValid only at participating Mankato area Great Clips salons. Not valid with any other offer. Limit one coupon per customer. No copies. Taxes may apply. Offer expires 02/27/2026.\n\nAll Great Clips® salons are independently owned and operated."
            },
            {
                "url": "https://offers.greatclips.com/xz28zQU",
                "match": false,
                "raw_description": "Description\nGet a great haircut for $9.99 only at participating San Antonio area Great Clips salons. To redeem the offer now, click “Redeem Now” and present this offer on your phone at the time of payment. To redeem the offer later, just enter your email and click “Save for Later”.\nTerms and Conditions\nValid only at participating San Antonio area Great Clips salons. Not valid with any other offer. Limit one coupon per customer. No copies. Taxes may apply. Offer expires 02/27/2026.\n\nAll Great Clips® salons are independently owned and operated."
            },
            {
                "url": "https://offers.greatclips.com/o5aXidu",
                "match": false,
                "raw_description": "Description\nGet a great haircut for $9.99 only at participating Hartford, N. Haven & N. London area Great Clips salons. To redeem the offer now, click “Redeem Now” and present this offer on your phone at the time of payment. To redeem the offer later, just enter your email and click “Save for Later”.\nTerms and Conditions\nValid only at participating Hartford, N. Haven & N. London area Great Clips salons . Not valid with any other offer. Limit one coupon per customer. No copies. Taxes may apply. Offer expires 02/27/2026.\n\nAll Great Clips® salons are independently owned and operated."
            },
            {
                "url": "https://offers.greatclips.com/3VHPb44",
                "match": false,
                "raw_description": "Description\nGet a great haircut for $9.99 only at participating Richmond area Great Clips salons. To redeem the offer now, click “Redeem Now” and present this offer on your phone at the time of payment. To redeem the offer later, just enter your email and click “Save for Later”.\nTerms and Conditions\nValid only at participating Richmond area Great Clips salons. Not valid with any other offer. Limit one coupon per customer. No copies. Taxes may apply. Offer expires 02/27/2026.\n\nAll Great Clips® salons are independently owned and operated."
            },
            {
                "url": "https://offers.greatclips.com/7GqMiDg",
                "match": false,
                "raw_description": "Description\nGet a great haircut for $9.99 only at participating Wilmington area Great Clips salons. To redeem the offer now, click “Redeem Now” and present this offer on your phone at the time of payment. To redeem the offer later, just enter your email and click “Save for Later”.\nTerms and Conditions\nValid only at participating Wilmington area Great Clips salons. Not valid with any other offer. Limit one coupon per customer. No copies. Taxes may apply. Offer expires 02/27/2026.\n\nAll Great Clips® salons are independently owned and operated."
            },
            {
                "url": "https://offers.greatclips.com/2a3MR4x",
                "match": false,
                "raw_description": "Description\nGet a great haircut for $9.99 only at participating Eastern Carolina area Great Clips salons. To redeem the offer now, click “Redeem Now” and present this offer on your phone at the time of payment. To redeem the offer later, just enter your email and click “Save for Later”.\nTerms and Conditions\nValid only at participating Eastern Carolina area Great Clips salons. Not valid with any other offer. Limit one coupon per customer. No copies. Taxes may apply. Offer expires 02/27/2026.\n\nAll Great Clips® salons are independently owned and operated."
            },
            {
                "url": "https://offers.greatclips.com/nnkUs1n",
                "match": false,
                "raw_description": "Description\nGet a great haircut for $9.99 at Great Clips Mill Creek Village at 444 Mill Creek Rd in Whispering Pines. To redeem the offer now, click “Redeem Now” and present this offer on your phone at the time of payment. To redeem the offer later, just enter your email and click “Save for Later”.\nTerms and Conditions\nValid at Great Clips Mill Creek Village at 444 Mill Creek Rd in Whispering Pines, NC. Not valid with any other offer. Limit one coupon per customer. No copies. Taxes may apply. Expires 03/13/2026.\n\nAll Great Clips® salons are independently owned and operated."
            },
            {
                "url": "https://offers.greatclips.com/BXIxWkO",
                "match": false,
                "raw_description": "Description\nGet a great haircut for $9.99 at Great Clips Chapel Hill North at 1814 Martin Luther King Jr Blvd in Chapel Hill. To redeem the offer now, click “Redeem Now” and present this offer on your phone at the time of payment. To redeem the offer later, just enter your email and click “Save for Later”.\nTerms and Conditions\nValid at Great Clips Chapel Hill North at 1814 Martin Luther King Jr Blvd in Chapel Hill, NC. Not valid with any other offer. Limit one coupon per customer. No copies. Taxes may apply. Expires 03/13/2026.\n\nAll Great Clips® salons are independently owned and operated."
            },
            {
                "url": "https://offers.greatclips.com/t9wiN8P",
                "match": false,
                "raw_description": "Description\nGet a great haircut for $9.99 at Great Clips Wake Forest Crossing at 1009 Stadium Dr in Wake Forest. To redeem the offer now, click “Redeem Now” and present this offer on your phone at the time of payment. To redeem the offer later, just enter your email and click “Save for Later”.\nTerms and Conditions\nValid at Great Clips Wake Forest Crossing at 1009 Stadium Dr in Wake Forest, NC. Not valid with any other offer. Limit one coupon per customer. No copies. Taxes may apply. Expires 03/13/2026.\n\nAll Great Clips® salons are independently owned and operated."
            },
            {
                "url": "https://offers.greatclips.com/qib8D2x",
                "match": false,
                "raw_description": "Description\nGet a great haircut for $7.99 only at participating Columbia area Great Clips salons. To redeem the offer now, click “Redeem Now” and present this offer on your phone at the time of payment. To redeem the offer later, just enter your email and click “Save for Later”.\nTerms and Conditions\nValid only at participating Columbia area Great Clips salons. Not valid with any other offer. Limit one coupon per customer. No copies. Taxes may apply. Offer expires 02/20/2026.\n\nAll Great Clips® salons are independently owned and operated."
            },
            {
                "url": "https://offers.greatclips.com/3PTd2BK",
                "match": false,
                "raw_description": "Description\nGet a great haircut for $7.99 at Great Clips Parmer Ranch Marketplace at 10104 RM 2338 in Georgetown. To redeem the offer now, click “Redeem Now” and present this offer on your phone at the time of payment. To redeem the offer later, just enter your email and click “Save for Later”.\nTerms and Conditions\nValid at Great Clips Parmer Ranch Marketplace at 10104 RM 2338 in Georgetown, TX. Not valid with any other offer. Limit one coupon per customer. No copies. Taxes may apply. Expires 03/13/2026.\n\nAll Great Clips® salons are independently owned and operated."
            },
            {
                "url": "https://offers.greatclips.com/inyk73R",
                "match": false,
                "raw_description": "Description\nGet a great haircut for $7.99 at Great Clips Market at Valley Parkway at 1079 W FM 3040 in Lewisville. To redeem the offer now, click “Redeem Now” and present this offer on your phone at the time of payment. To redeem the offer later, just enter your email and click “Save for Later”.\nTerms and Conditions\nValid at Great Clips Market at Valley Parkway at 1079 W FM 3040 in Lewisville, TX. Not valid with any other offer. Limit one coupon per customer. No copies. Taxes may apply. Expires 03/09/2026.\n\nAll Great Clips® salons are independently owned and operated."
            },
            {
                "url": "https://offers.greatclips.com/FdvzNho",
                "match": false,
                "raw_description": "Description\nGet a great haircut for $7.99 at Great Clips Lakepointe Towne Crossing at 729 Hebron Pkwy in Lewisville. To redeem the offer now, click “Redeem Now” and present this offer on your phone at the time of payment. To redeem the offer later, just enter your email and click “Save for Later”.\nTerms and Conditions\nValid at Great Clips Lakepointe Towne Crossing at 729 Hebron Pkwy in Lewisville, TX. Not valid with any other offer. Limit one coupon per customer. No copies. Taxes may apply. Expires 03/09/2026.\n\nAll Great Clips® salons are independently owned and operated."
            },
            {
                "url": "https://offers.greatclips.com/oWtV1Z3",
                "match": false,
                "raw_description": "Description\nGet a great haircut for $7.99 at Great Clips Shops at Hudson Oaks at 100 S Oakridge Dr in Hudson Oaks. To redeem the offer now, click “Redeem Now” and present this offer on your phone at the time of payment. To redeem the offer later, just enter your email and click “Save for Later”.\nTerms and Conditions\nValid at Great Clips Shops at Hudson Oaks at 100 S Oakridge Dr in Hudson Oaks, TX. Not valid with any other offer. Limit one coupon per customer. No copies. Taxes may apply. Expires 03/07/2026.\n\nAll Great Clips® salons are independently owned and operated."
            },
            {
                "url": "https://offers.greatclips.com/XNzV80C",
                "match": false,
                "raw_description": "Description\nGet a great haircut for $7.99 at Great Clips Basswood Crossing at 7451 N Beach St in Fort Worth. To redeem the offer now, click “Redeem Now” and present this offer on your phone at the time of payment. To redeem the offer later, just enter your email and click “Save for Later”.\nTerms and Conditions\nValid at Great Clips Basswood Crossing at 7451 N Beach St in Fort Worth, TX. Not valid with any other offer. Limit one coupon per customer. No copies. Taxes may apply. Expires 03/07/2026.\n\nAll Great Clips® salons are independently owned and operated."
            },
            {
                "url": "https://offers.greatclips.com/ibCVDhD",
                "match": false,
                "raw_description": "Description\nGet a great haircut for $7.99 at Great Clips Clifford Retail Center at 301 Clifford Center Dr in Fort Worth. To redeem the offer now, click “Redeem Now” and present this offer on your phone at the time of payment. To redeem the offer later, just enter your email and click “Save for Later”.\nTerms and Conditions\nValid at Great Clips Clifford Retail Center at 301 Clifford Center Dr in Fort Worth, TX. Not valid with any other offer. Limit one coupon per customer. No copies. Taxes may apply. Expires 03/07/2026.\n\nAll Great Clips® salons are independently owned and operated."
            },
            {
                "url": "https://offers.greatclips.com/jyjcN1r",
                "match": false,
                "raw_description": "Description\nGet a great haircut for $7.99 at Great Clips Timberland at 12584 N Beach St in Fort Worth. To redeem the offer now, click “Redeem Now” and present this offer on your phone at the time of payment. To redeem the offer later, just enter your email and click “Save for Later”.\nTerms and Conditions\nValid at Great Clips Timberland at 12584 N Beach St in Fort Worth, TX. Not valid with any other offer. Limit one coupon per customer. No copies. Taxes may apply. Expires 03/07/2026.\n\nAll Great Clips® salons are independently owned and operated."
            },
            {
                "url": "https://offers.greatclips.com/ilIfHyL",
                "match": false,
                "raw_description": "Description\nGet a great haircut for $7.99 at Great Clips Beach Western Commons at 6650 N Beach St in Fort Worth. To redeem the offer now, click “Redeem Now” and present this offer on your phone at the time of payment. To redeem the offer later, just enter your email and click “Save for Later”.\nTerms and Conditions\nValid at Great Clips Beach Western Commons at 6650 N Beach St in Fort Worth, TX. Not valid with any other offer. Limit one coupon per customer. No copies. Taxes may apply. Expires 03/07/2026.\n\nAll Great Clips® salons are independently owned and operated."
            },
            {
                "url": "https://offers.greatclips.com/2GSY9yR",
                "match": false,
                "raw_description": "Description\nGet a great haircut for $7.99 at Great Clips Tuckahoe Village Shopping Center at 11220 Patterson Avenue in Richmond. To redeem the offer now, click “Redeem Now” and present this offer on your phone at the time of payment. To redeem the offer later, just enter your email and click “Save for Later”.\nTerms and Conditions\nValid at Great Clips Tuckahoe Village Shopping Center at 11220 Patterson Avenue in Richmond, VA. Not valid with any other offer. Limit one coupon per customer. No copies. Taxes may apply. Expires 02/27/2026.\n\nAll Great Clips® salons are independently owned and operated."
            },
            {
                "url": "https://offers.greatclips.com/4SKsZQr",
                "match": false,
                "raw_description": "Description\nGet a great haircut for $5.99 at Great Clips Park Row Place at 2504 W Park Row Dr in Pantego. To redeem the offer now, click “Redeem Now” and present this offer on your phone at the time of payment. To redeem the offer later, just enter your email and click “Save for Later”.\nTerms and Conditions\nValid at Great Clips Park Row Place at 2504 W Park Row Dr in Pantego, TX. Not valid with any other offer. Limit one coupon per customer. No copies. Taxes may apply. Expires 03/07/2026.\n\nAll Great Clips® salons are independently owned and operated."
            },
            {
                "url": "https://offers.greatclips.com/kzlIvVs",
                "match": false,
                "raw_description": "Description\nGet a great haircut for $5.99 at Great Clips Cross Creek Durant at 3601 W Main St in Durant. To redeem the offer now, click “Redeem Now” and present this offer on your phone at the time of payment. To redeem the offer later, just enter your email and click “Save for Later”.\nTerms and Conditions\nValid at Great Clips Cross Creek Durant at 3601 W Main St in Durant, OK. Not valid with any other offer. Limit one coupon per customer. No copies. Taxes may apply. Expires 03/07/2026.\n\nAll Great Clips® salons are independently owned and operated."
            },
            {
                "url": "https://offers.greatclips.com/p1Ib23W",
                "match": false,
                "raw_description": "Description\nGet a great haircut for $5.99 at Great Clips Ada at 1400 Lonnie Abbott Blvd in Ada. To redeem the offer now, click “Redeem Now” and present this offer on your phone at the time of payment. To redeem the offer later, just enter your email and click “Save for Later”.\nTerms and Conditions\nValid at Great Clips Ada at 1400 Lonnie Abbott Blvd in Ada, OK. Not valid with any other offer. Limit one coupon per customer. No copies. Taxes may apply. Expires 03/07/2026.\n\nAll Great Clips® salons are independently owned and operated."
            },
            {
                "url": "https://offers.greatclips.com/oO6iQmh",
                "match": false,
                "raw_description": "Description\nGet a great haircut for $5.99 at Great Clips Paris at 3915 Lamar Ave in Paris. To redeem the offer now, click “Redeem Now” and present this offer on your phone at the time of payment. To redeem the offer later, just enter your email and click “Save for Later”.\nTerms and Conditions\nValid at Great Clips Paris at 3915 Lamar Ave in Paris, TX. Not valid with any other offer. Limit one coupon per customer. No copies. Taxes may apply. Expires 03/07/2026.\n\nAll Great Clips® salons are independently owned and operated."
            },
            {
                "url": "https://offers.greatclips.com/p6iRSG0",
                "match": false,
                "raw_description": "Description\nGet a great haircut for $5.99 at Great Clips Market Street at Ardmore at 1525 12th Ave NW in Ardmore. To redeem the offer now, click “Redeem Now” and present this offer on your phone at the time of payment. To redeem the offer later, just enter your email and click “Save for Later”.\nTerms and Conditions\nValid at Great Clips Market Street at Ardmore at 1525 12th Ave NW in Ardmore, OK. Not valid with any other offer. Limit one coupon per customer. No copies. Taxes may apply. Expires 03/07/2026.\n\nAll Great Clips® salons are independently owned and operated."
            },
            {
                "url": "https://offers.greatclips.com/cMuXZnr",
                "match": false,
                "raw_description": "Description\nGet a great haircut for $5.99 at Great Clips Eastchase Market at 1550 Eastchase Pkwy in Fort Worth. To redeem the offer now, click “Redeem Now” and present this offer on your phone at the time of payment. To redeem the offer later, just enter your email and click “Save for Later”.\nTerms and Conditions\nValid at Great Clips Eastchase Market at 1550 Eastchase Pkwy in Fort Worth, TX. Not valid with any other offer. Limit one coupon per customer. No copies. Taxes may apply. Expires 03/07/2026.\n\nAll Great Clips® salons are independently owned and operated."
            },
            {
                "url": "https://offers.greatclips.com/H3bYyPD",
                "match": false,
                "raw_description": "Description\nGet a great haircut for $5.99 at Great Clips Left Bank Market at 628 Harrold St in Fort Worth. To redeem the offer now, click “Redeem Now” and present this offer on your phone at the time of payment. To redeem the offer later, just enter your email and click “Save for Later”.\nTerms and Conditions\nValid at Great Clips Left Bank Market at 628 Harrold St in Fort Worth, TX. Not valid with any other offer. Limit one coupon per customer. No copies. Taxes may apply. Expires 03/07/2026.\n\nAll Great Clips® salons are independently owned and operated."
            },
            {
                "url": "https://offers.greatclips.com/kSJcwvL",
                "match": false,
                "raw_description": "Description\nGet a great haircut for $5.99 at Great Clips Pineborough Shopping Center at 1501 W Church St in Livingston. To redeem the offer now, click “Redeem Now” and present this offer on your phone at the time of payment. To redeem the offer later, just enter your email and click “Save for Later”.\nTerms and Conditions\nValid at Great Clips Pineborough Shopping Center at 1501 W Church St in Livingston, TX. Not valid with any other offer. Limit one coupon per customer. No copies. Taxes may apply. Expires 02/23/2026.\n\nAll Great Clips® salons are independently owned and operated."
            },
            {
                "url": "https://offers.greatclips.com/Ao59KZQ",
                "match": false,
                "raw_description": "Description\nGet a great haircut for $14.99 only at participating LaCrosse-Eau Claire area Great Clips salons. To redeem the offer now, click “Redeem Now” and present this offer on your phone at the time of payment. To redeem the offer later, just enter your email and click “Save for Later”.\nTerms and Conditions\nValid only at participating LaCrosse-Eau Claire area Great Clips salons. Not valid with any other offer. Limit one coupon per customer. No copies. Taxes may apply. Offer expires 03/06/2026.\n\nAll Great Clips® salons are independently owned and operated."
            },
            {
                "url": "https://offers.greatclips.com/tAd4UAV",
                "match": false,
                "raw_description": "Description\nGet a great haircut for $14.99 at Great Clips Shops at Waterford at 4550 Tassajara Rd in Dublin. To redeem the offer now, click “Redeem Now” and present this offer on your phone at the time of payment. To redeem the offer later, just enter your email and click “Save for Later”.\nTerms and Conditions\nValid at Great Clips Shops at Waterford at 4550 Tassajara Rd in Dublin, CA. Not valid with any other offer. Limit one coupon per customer. No copies. Taxes may apply. Expires 03/07/2026.\n\nAll Great Clips® salons are independently owned and operated."
            },
            {
                "url": "https://offers.greatclips.com/6sLsJMs",
                "match": false,
                "raw_description": "Description\nGet a great haircut for $14.99 at Great Clips Vernon Hills at 700 N Milwaukee Ave in Vernon Hills. To redeem the offer now, click “Redeem Now” and present this offer on your phone at the time of payment. To redeem the offer later, just enter your email and click “Save for Later”.\nTerms and Conditions\nValid at Great Clips Vernon Hills at 700 N Milwaukee Ave in Vernon Hills, IL. Not valid with any other offer. Limit one coupon per customer. No copies. Taxes may apply. Expires 03/07/2026.\n\nAll Great Clips® salons are independently owned and operated."
            },
            {
                "url": "https://offers.greatclips.com/JNx7FjW",
                "match": false,
                "raw_description": "Description\nGet a great haircut for $14.99 at Great Clips Antioch Crossings at 417 E Route 173 in Antioch. To redeem the offer now, click “Redeem Now” and present this offer on your phone at the time of payment. To redeem the offer later, just enter your email and click “Save for Later”.\nTerms and Conditions\nValid at Great Clips Antioch Crossings at 417 E Route 173 in Antioch, IL. Not valid with any other offer. Limit one coupon per customer. No copies. Taxes may apply. Expires 03/07/2026.\n\nAll Great Clips® salons are independently owned and operated."
            },
            {
                "url": "https://offers.greatclips.com/8keIWyV",
                "match": false,
                "raw_description": "Description\nGet a great haircut for $14.99 at Great Clips Algonquin Town Center at 1542 E Algonquin Rd in Algonquin. To redeem the offer now, click “Redeem Now” and present this offer on your phone at the time of payment. To redeem the offer later, just enter your email and click “Save for Later”.\nTerms and Conditions\nValid at Great Clips Algonquin Town Center at 1542 E Algonquin Rd in Algonquin, IL. Not valid with any other offer. Limit one coupon per customer. No copies. Taxes may apply. Expires 03/07/2026.\n\nAll Great Clips® salons are independently owned and operated."
            },
            {
                "url": "https://offers.greatclips.com/SlJV7Tm",
                "match": false,
                "raw_description": "Description\nGet a great haircut for $14.99 at Great Clips Town and Country at 377 E Palatine Rd in Arlington Heights. To redeem the offer now, click “Redeem Now” and present this offer on your phone at the time of payment. To redeem the offer later, just enter your email and click “Save for Later”.\nTerms and Conditions\nValid at Great Clips Town and Country at 377 E Palatine Rd in Arlington Heights, IL. Not valid with any other offer. Limit one coupon per customer. No copies. Taxes may apply. Expires 03/07/2026.\n\nAll Great Clips® salons are independently owned and operated."
            },
            {
                "url": "https://offers.greatclips.com/oUmVthr",
                "match": false,
                "raw_description": "Description\nGet a great haircut for $14.99 at Great Clips Mundelein Commons at 1146 W Maple Ave in Mundelein. To redeem the offer now, click “Redeem Now” and present this offer on your phone at the time of payment. To redeem the offer later, just enter your email and click “Save for Later”.\nTerms and Conditions\nValid at Great Clips Mundelein Commons at 1146 W Maple Ave in Mundelein, IL. Not valid with any other offer. Limit one coupon per customer. No copies. Taxes may apply. Expires 03/07/2026.\n\nAll Great Clips® salons are independently owned and operated."
            },
            {
                "url": "https://offers.greatclips.com/WZ8Gedp",
                "match": false,
                "raw_description": "Description\nGet a great haircut for $14.99 at Great Clips Round Lake Beach at 528 E Rollins Rd in Round Lake Beach. To redeem the offer now, click “Redeem Now” and present this offer on your phone at the time of payment. To redeem the offer later, just enter your email and click “Save for Later”.\nTerms and Conditions\nValid at Great Clips Round Lake Beach at 528 E Rollins Rd in Round Lake Beach, IL. Not valid with any other offer. Limit one coupon per customer. No copies. Taxes may apply. Expires 03/07/2026.\n\nAll Great Clips® salons are independently owned and operated."
            },
            {
                "url": "https://offers.greatclips.com/ibYXUte",
                "match": false,
                "raw_description": "Description\nGet a great haircut for $14.99 at Great Clips Cary Square at 720 Northwest Hwy in Cary. To redeem the offer now, click “Redeem Now” and present this offer on your phone at the time of payment. To redeem the offer later, just enter your email and click “Save for Later”.\nTerms and Conditions\nValid at Great Clips Cary Square at 720 Northwest Hwy in Cary, IL. Not valid with any other offer. Limit one coupon per customer. No copies. Taxes may apply. Expires 03/07/2026.\n\nAll Great Clips® salons are independently owned and operated."
            },
            {
                "url": "https://offers.greatclips.com/68nlfRx",
                "match": false,
                "raw_description": "Description\nGet a great haircut for $14.99 at Great Clips Country Corners at 230 W Virginia Rd in Crystal Lake. To redeem the offer now, click “Redeem Now” and present this offer on your phone at the time of payment. To redeem the offer later, just enter your email and click “Save for Later”.\nTerms and Conditions\nValid at Great Clips Country Corners at 230 W Virginia Rd in Crystal Lake, IL. Not valid with any other offer. Limit one coupon per customer. No copies. Taxes may apply. Expires 03/07/2026.\n\nAll Great Clips® salons are independently owned and operated."
            },
            {
                "url": "https://offers.greatclips.com/Z0LoKH1",
                "match": false,
                "raw_description": "Description\nGet a great haircut for $4.99 at Great Clips South Point at 4165 9th St SW in Vero Beach. To redeem the offer now, click “Redeem Now” and present this offer on your phone at the time of payment. To redeem the offer later, just enter your email and click “Save for Later”.\nTerms and Conditions\nValid at Great Clips South Point at 4165 9th St SW in Vero Beach , FL. Not valid with any other offer. Limit one coupon per customer. No copies. Taxes may apply. Expires 03/07/2026.\n\nAll Great Clips® salons are independently owned and operated."
            },
            {
                "url": "https://offers.greatclips.com/HmVwNp8",
                "match": false,
                "raw_description": "Description\nGet a great haircut for $3.99 at Great Clips Cross Creek Durant at 3601 W Main St in Durant. To redeem the offer now, click “Redeem Now” and present this offer on your phone at the time of payment. To redeem the offer later, just enter your email and click “Save for Later”.\nTerms and Conditions\nValid at Great Clips Cross Creek Durant at 3601 W Main St in Durant, OK. Not valid with any other offer. Limit one coupon per customer. No copies. Taxes may apply. Expires 02/16/2026.\n\nAll Great Clips® salons are independently owned and operated."
            },
            {
                "url": "https://offers.greatclips.com/FqlBblr",
                "match": false,
                "raw_description": "Description\nGet a great haircut for $6.99 at Great Clips Valley View Central at 13260 Josey Lane in Farmers Branch. To redeem the offer now, click “Redeem Now” and present this offer on your phone at the time of payment. To redeem the offer later, just enter your email and click “Save for Later”.\nTerms and Conditions\nValid at Great Clips Valley View Central at 13260 Josey Lane in Farmers Branch, TX. Not valid with any other offer. Limit one coupon per customer. No copies. Taxes may apply. Expires 03/07/2026.\n\nAll Great Clips® salons are independently owned and operated."
            },
            {
                "url": "https://offers.greatclips.com/Jq4pAZE",
                "match": false,
                "raw_description": "Description\nGet a great haircut for $6.99 at Great Clips Park Forest Northeast at 3767 Forest Ln in Dallas. To redeem the offer now, click “Redeem Now” and present this offer on your phone at the time of payment. To redeem the offer later, just enter your email and click “Save for Later”.\nTerms and Conditions\nValid at Great Clips Park Forest Northeast at 3767 Forest Ln in Dallas, TX. Not valid with any other offer. Limit one coupon per customer. No copies. Taxes may apply. Expires 03/07/2026.\n\nAll Great Clips® salons are independently owned and operated."
            },
            {
                "url": "https://offers.greatclips.com/XqWtDxz",
                "match": false,
                "raw_description": "Description\nGet a great haircut for $6.99 at Great Clips Market at Preston Forest at 6063 Forest Ln in Dallas. To redeem the offer now, click “Redeem Now” and present this offer on your phone at the time of payment. To redeem the offer later, just enter your email and click “Save for Later”.\nTerms and Conditions\nValid at Great Clips Market at Preston Forest at 6063 Forest Ln in Dallas, TX. Not valid with any other offer. Limit one coupon per customer. No copies. Taxes may apply. Expires 03/07/2026.\n\nAll Great Clips® salons are independently owned and operated."
            },
            {
                "url": "https://offers.greatclips.com/OY0K7gQ",
                "match": false,
                "raw_description": "Description\nGet a great haircut for $6.99 at Great Clips Weatherford Commons at 1968 S Main St in Weatherford. To redeem the offer now, click “Redeem Now” and present this offer on your phone at the time of payment. To redeem the offer later, just enter your email and click “Save for Later”.\nTerms and Conditions\nValid at Great Clips Weatherford Commons at 1968 S Main St in Weatherford, TX. Not valid with any other offer. Limit one coupon per customer. No copies. Taxes may apply. Expires 03/07/2026.\n\nAll Great Clips® salons are independently owned and operated."
            },
            {
                "url": "https://offers.greatclips.com/mDFpUbv",
                "match": false,
                "raw_description": "Description\nGet a great haircut for $6.99 at Great Clips Sherman Town Center at 4114 Hwy 75 N in Sherman. To redeem the offer now, click “Redeem Now” and present this offer on your phone at the time of payment. To redeem the offer later, just enter your email and click “Save for Later”.\nTerms and Conditions\nValid at Great Clips Sherman Town Center at 4114 Hwy 75 N in Sherman, TX. Not valid with any other offer. Limit one coupon per customer. No copies. Taxes may apply. Expires 03/07/2026.\n\nAll Great Clips® salons are independently owned and operated."
            },
            {
                "url": "https://offers.greatclips.com/KTwmP0m",
                "match": false,
                "raw_description": "Description\nGet a great haircut for $6.99 at Great Clips Shops at Roxboro at 719 N Madison Blvd in Roxboro. To redeem the offer now, click “Redeem Now” and present this offer on your phone at the time of payment. To redeem the offer later, just enter your email and click “Save for Later”.\nTerms and Conditions\nValid at Great Clips Shops at Roxboro at 719 N Madison Blvd in Roxboro, NC. Not valid with any other offer. Limit one coupon per customer. No copies. Taxes may apply. Expires 03/06/2026.\n\nAll Great Clips® salons are independently owned and operated."
            },
            {
                "url": "https://offers.greatclips.com/4TlEsJP",
                "match": false,
                "raw_description": "Description\nGet a great haircut for $11.99 only at participating Sioux Falls-Worthington area Great Clips salons. To redeem the offer now, click “Redeem Now” and present this offer on your phone at the time of payment. To redeem the offer later, just enter your email and click “Save for Later”.\nTerms and Conditions\nValid only at participating Sioux Falls-Worthington area Great Clips salons. Not valid with any other offer. Limit one coupon per customer. No copies. Taxes may apply. Offer expires 02/27/2026.\n\nAll Great Clips® salons are independently owned and operated."
            },
            {
                "url": "https://offers.greatclips.com/F2zEagt",
                "match": false,
                "raw_description": "Description\nGet a great haircut for $11.99 only at participating Paducah-Cape Girardeau-Harrisburg area Great Clips salons. To redeem the offer now, click “Redeem Now” and present this offer on your phone at the time of payment. To redeem the offer later, just enter your email and click “Save for Later”.\nTerms and Conditions\nValid only at participating Paducah-Cape Girardeau-Harrisburg area Great Clips salons. Not valid with any other offer. Limit one coupon per customer. No copies. Taxes may apply. Offer expires 02/20/2026.\n\nAll Great Clips® salons are independently owned and operated."
            },
            {
                "url": "https://offers.greatclips.com/AqBf1YO",
                "match": false,
                "raw_description": "Description\nGet a great haircut for $11.99 at Great Clips Schoenherr Shoppes at 25385 Schoenherr Rd in Warren. To redeem the offer now, click “Redeem Now” and present this offer on your phone at the time of payment. To redeem the offer later, just enter your email and click “Save for Later”.\nTerms and Conditions\nValid at Great Clips Schoenherr Shoppes at 25385 Schoenherr Rd in Warren, MI. Not valid with any other offer. Limit one coupon per customer. No copies. Taxes may apply. Expires 03/06/2026.\n\nAll Great Clips® salons are independently owned and operated."
            },
            {
                "url": "https://offers.greatclips.com/fjYJWjb",
                "match": false,
                "raw_description": "Description\nGet a great haircut for $11.99 at Great Clips Hazel Park at 1162 E 9 Mile Rd in Hazel Park. To redeem the offer now, click “Redeem Now” and present this offer on your phone at the time of payment. To redeem the offer later, just enter your email and click “Save for Later”.\nTerms and Conditions\nValid at Great Clips Hazel Park at 1162 E 9 Mile Rd in Hazel Park, MI. Not valid with any other offer. Limit one coupon per customer. No copies. Taxes may apply. Expires 03/06/2026.\n\nAll Great Clips® salons are independently owned and operated."
            },
            {
                "url": "https://offers.greatclips.com/bw5R3Dl",
                "match": false,
                "raw_description": "Description\nGet a great haircut for $11.99 at Great Clips Lincoln Park at 1875 Southfield Rd in Lincoln Park. To redeem the offer now, click “Redeem Now” and present this offer on your phone at the time of payment. To redeem the offer later, just enter your email and click “Save for Later”.\nTerms and Conditions\nValid at Great Clips Lincoln Park at 1875 Southfield Rd in Lincoln Park, MI. Not valid with any other offer. Limit one coupon per customer. No copies. Taxes may apply. Expires 03/06/2026.\n\nAll Great Clips® salons are independently owned and operated."
            },
            {
                "url": "https://offers.greatclips.com/3kGnEmU",
                "match": false,
                "raw_description": "Description\nGet a great haircut for $11.99 at Great Clips Heritage Village at 5715 12 Mile Rd in Warren. To redeem the offer now, click “Redeem Now” and present this offer on your phone at the time of payment. To redeem the offer later, just enter your email and click “Save for Later”.\nTerms and Conditions\nValid at Great Clips Heritage Village at 5715 12 Mile Rd in Warren, MI. Not valid with any other offer. Limit one coupon per customer. No copies. Taxes may apply. Expires 03/06/2026.\n\nAll Great Clips® salons are independently owned and operated."
            },
            {
                "url": "https://offers.greatclips.com/eftOLOl",
                "match": false,
                "raw_description": "Description\nGet a great haircut for $11.99 at Great Clips Clocktower Commons at 15190 Bluebird St NW in Andover. To redeem the offer now, click “Redeem Now” and present this offer on your phone at the time of payment. To redeem the offer later, just enter your email and click “Save for Later”.\nTerms and Conditions\nValid at Great Clips Clocktower Commons at 15190 Bluebird St NW in Andover, MN. Not valid with any other offer. Limit one coupon per customer. No copies. Taxes may apply. Expires 02/27/2026.\n\nAll Great Clips® salons are independently owned and operated."
            },
            {
                "url": "https://offers.greatclips.com/Y6S6fbS",
                "match": false,
                "raw_description": "Description\nGet a great haircut for $11.99 at Great Clips Park Place Promenade at 9672 Colorado Ln N in Brooklyn Park. To redeem the offer now, click “Redeem Now” and present this offer on your phone at the time of payment. To redeem the offer later, just enter your email and click “Save for Later”.\nTerms and Conditions\nValid at Great Clips Park Place Promenade at 9672 Colorado Ln N in Brooklyn Park, MN. Not valid with any other offer. Limit one coupon per customer. No copies. Taxes may apply. Expires 02/27/2026.\n\nAll Great Clips® salons are independently owned and operated."
            },
            {
                "url": "https://offers.greatclips.com/B3npbR1",
                "match": false,
                "raw_description": "Description\nGet a great haircut for $11.99 at Great Clips Duck Creek at 840 Middle Rd in Bettendorf. To redeem the offer now, click “Redeem Now” and present this offer on your phone at the time of payment. To redeem the offer later, just enter your email and click “Save for Later”.\nTerms and Conditions\nValid at Great Clips Duck Creek at 840 Middle Rd in Bettendorf, IA. Not valid with any other offer. Limit one coupon per customer. No copies. Taxes may apply. Expires 02/27/2026.\n\nAll Great Clips® salons are independently owned and operated."
            },
            {
                "url": "https://offers.greatclips.com/W7zItWh",
                "match": false,
                "raw_description": "Description\nGet a great haircut for $11.99 at Great Clips Bett Plex at 6924 Competition Court in Bettendorf. To redeem the offer now, click “Redeem Now” and present this offer on your phone at the time of payment. To redeem the offer later, just enter your email and click “Save for Later”.\nTerms and Conditions\nValid at Great Clips Bett Plex at 6924 Competition Court in Bettendorf, IA. Not valid with any other offer. Limit one coupon per customer. No copies. Taxes may apply. Expires 02/27/2026.\n\nAll Great Clips® salons are independently owned and operated."
            },
            {
                "url": "https://offers.greatclips.com/FL0lYjm",
                "match": false,
                "raw_description": "Description\nGet a great haircut for $17.99 at Great Clips Forum Centre at 3398 Forum Blvd in Fort Myers. To redeem the offer now, click “Redeem Now” and present this offer on your phone at the time of payment. To redeem the offer later, just enter your email and click “Save for Later”.\nTerms and Conditions\nValid at Great Clips Forum Centre at 3398 Forum Blvd in Fort Myers, FL. Not valid with any other offer. Limit one coupon per customer. No copies. Taxes may apply. Expires 02/28/2026.\n\nAll Great Clips® salons are independently owned and operated."
            },
            {
                "url": "https://offers.greatclips.com/bWp2H5l",
                "match": false,
                "raw_description": "Description\nGet a great haircut for $13.99 only at participating Colorado Springs-Pueblo area Great Clips salons. To redeem the offer now, click “Redeem Now” and present this offer on your phone at the time of payment. To redeem the offer later, just enter your email and click “Save for Later”.\nTerms and Conditions\nValid only at participating Colorado Springs-Pueblo area Great Clips salons. Not valid with any other offer. Limit one coupon per customer. No copies. Taxes may apply. Offer expires 02/27/2026.\n\nAll Great Clips® salons are independently owned and operated."
            },
            {
                "url": "https://offers.greatclips.com/1ZCzkr8",
                "match": false,
                "raw_description": "Description\nGet a great haircut for $13.99 at Great Clips Ann Arbor - Saline Meijer at 3145 Ann Arbor Saline Rd in Ann Arbor. To redeem the offer now, click “Redeem Now” and present this offer on your phone at the time of payment. To redeem the offer later, just enter your email and click “Save for Later”.\nTerms and Conditions\nValid at Great Clips Ann Arbor - Saline Meijer at 3145 Ann Arbor Saline Rd in Ann Arbor, MI. Not valid with any other offer. Limit one coupon per customer. No copies. Taxes may apply. Expires 03/06/2026.\n\nAll Great Clips® salons are independently owned and operated."
            },
            {
                "url": "https://offers.greatclips.com/Tt1ojG7",
                "match": false,
                "raw_description": "Description\nGet a great haircut for $13.99 at Great Clips Stadium & Packard at 1423 E Stadium Blvd in Ann Arbor. To redeem the offer now, click “Redeem Now” and present this offer on your phone at the time of payment. To redeem the offer later, just enter your email and click “Save for Later”.\nTerms and Conditions\nValid at Great Clips Stadium & Packard at 1423 E Stadium Blvd in Ann Arbor, MI. Not valid with any other offer. Limit one coupon per customer. No copies. Taxes may apply. Expires 03/06/2026.\n\nAll Great Clips® salons are independently owned and operated."
            },
            {
                "url": "https://offers.greatclips.com/Tqwvf4x",
                "match": false,
                "raw_description": "Description\nGet a great haircut for $13.99 at Great Clips Meijers White Lake at 6001 Highland Rd in White Lake. To redeem the offer now, click “Redeem Now” and present this offer on your phone at the time of payment. To redeem the offer later, just enter your email and click “Save for Later”.\nTerms and Conditions\nValid at Great Clips Meijers White Lake at 6001 Highland Rd in White Lake, MI. Not valid with any other offer. Limit one coupon per customer. No copies. Taxes may apply. Expires 02/20/2026.\n\nAll Great Clips® salons are independently owned and operated."
            }
        ]
    }
}